Revit 2027 API
RebarUpdateCurvesData.GetAttachmentType Method
 Returns attachment type for stirrups to be used in cover calculation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StirrupTieAttachmentType GetAttachmentType()
Public Function GetAttachmentType As StirrupTieAttachmentType
public:
StirrupTieAttachmentType GetAttachmentType()
member GetAttachmentType : unit -> StirrupTieAttachmentType
Return Value
StirrupTieAttachmentType
InteriorFace : rebar to attach to interior face of cover reference.
ExteriorFace : rebar to attach to exterior face of cover reference.
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace